app/controllers/api/deliveries_controller.rb

SELECT "deliveries".* FROM "deliveries"
---
    def index
      render partial: "shared/json/deliveries.json", locals: {
          deliveries: Delivery.includes(:sender, :receiver).all,
      }

SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
      delivery = Delivery.includes(:sender, :receiver).find(params[:id])

INSERT INTO "deliveries" ("drone_id", "status", "origin_longitude", "origin_latitude", "destination_longitude", "destination_latitude", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
      params.permit(:drone_id, :status, :origin, :destination, :sender_id, :receiver_id)

      status = params[:status] || :pending
      delivery = Delivery.create!(drone_id: params[:drone_id],
                                  status: status,
                                  origin_latitude: params.dig(:origin, :latitude),
                                  origin_longitude: params.dig(:origin, :longitude),
                                  destination_latitude: params.dig(:destination, :latitude),
                                  destination_longitude: params.dig(:destination, :longitude),
                                  sender_id: params[:sender_id],
                                  receiver_id: params[:receiver_id])

      render partial: "shared/json/delivery.json", status: :created, locals: {
          delivery: delivery,
          sender: User.find(params[:sender_id]),
          receiver: User.find(params[:receiver_id])