app/controllers/api/drones_controller.rb

    def index
      render partial: "shared/json/drones.json", locals: {
          drones: Drone.all,
      }
---
SELECT "drones".* FROM "drones"

    def show
      render partial: "shared/json/drone.json", locals: {
          drone: Drone.find(params[:id]),
      }
---
SELECT  "drones".* FROM "drones" WHERE "drones"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
      params.permit(:status, :battery_percent, position: [:latitude, :longitude])

      drone = Drone.create!(latitude: params[:position][:latitude],
                            longitude: params[:position][:longitude],
                            status: params[:status],
                            battery_percent: params[:battery_percent])
---
INSERT INTO "drones" ("latitude", "longitude", "status", "battery_percent", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["latitude", 17.0], ["longitude", 23.0], ["status", "cool"], ["battery_percent", 1], ["created_at", "2018-09-22 15:46:19.019679"], ["updated_at", "2018-09-22 15:46:19.019679"]]