app/controllers/api/users_controller.rb

    def index
      render partial: "shared/json/users.json", locals: {
          users: User.all,
      }
---
SELECT "users".* FROM "users"

    def create
      params.permit(:email, :first_name, :last_name, :password)

      user = User.create!(email: params[:email], first_name: params[:first_name], last_name: params[:last_name], password: params[:password])
---
INSERT INTO "users" ("email", "created_at", "updated_at", "first_name", "last_name", "password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "abc@abd.abc"], ["created_at", "2018-09-16 20:46:21.448308"], ["updated_at", "2018-09-16 20:46:21.448308"], ["first_name", "name"], ["last_name", "name"], ["password", "xyz"]]