app/views/shared/json/_delivery.json.jbuilder

end
json.createdDate		delivery.created_at
---
INSERT INTO "deliveries" ("drone_id", "status", "origin_longitude", "origin_latitude", "destination_longitude", "destination_latitude", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"